In [1]:
import pandas as pd

In [4]:
# Creating a DataFrame by passing a dictionary of objects where the keys are the column labels 
# and the values are the column values.

students = {'CNE': [1456, 2734, 3213, 4764, 5098, 6129],
            'CIN': ['CD98', 'N476', 'CD76', 'JD45', 'K945', 'MC81'],
            'Name': ['Sara Alami', 'Mohammed Benis', 'Ali Esafi', 'Sara Alami', 'Mouad Derwich', 'Ghita Zeroual'],
            'Department': ['Physics', 'Mathematics', 'Biology', 'Physics', 'Geology', 'Computer Science']}

df_dic1 = pd.DataFrame(students)

In [5]:
df_dic1

    CNE   CIN            Name        Department
0  1456  CD98      Sara Alami            Physic
1  2734  N476  Mohammed Benis        Mathematic
2  3213  CD76       Ali Esafi           Biology
3  4764  JD45      Sara Alami            Physic
4  5098  K945   Mouad Derwich           Geology
5  6129  MC81   Ghita Zeroual  Computer Science

In [9]:
# Save dataframe to csv file
df_dic1.to_csv('C:/Users/Pc/Documents/TP-python/M2SI/my_first_df.csv', index=False)

In [10]:
# Import dataframe from csv file
my_first_df = pd.read_csv('C:/Users/Pc/Documents/TP-python/M2SI/my_first_df.csv')

In [11]:
my_first_df

    CNE   CIN            Name        Department
0  1456  CD98      Sara Alami            Physic
1  2734  N476  Mohammed Benis        Mathematic
2  3213  CD76       Ali Esafi           Biology
3  4764  JD45      Sara Alami            Physic
4  5098  K945   Mouad Derwich           Geology
5  6129  MC81   Ghita Zeroual  Computer Science

In [6]:
# By default, DataFrame addâ€™s a numeric index starting from zero. It can be changed with a custom index 
# while creating a DataFrame.

index_label=["r1","r2", "r3","r4", "r5","r6"]
df_dic2 = pd.DataFrame(students, index=index_label)

In [7]:
df_dic2

     CNE   CIN            Name        Department
r1  1456  CD98      Sara Alami            Physic
r2  2734  N476  Mohammed Benis        Mathematic
r3  3213  CD76       Ali Esafi           Biology
r4  4764  JD45      Sara Alami            Physic
r5  5098  K945   Mouad Derwich           Geology
r6  6129  MC81   Ghita Zeroual  Computer Science

In [8]:
# Creates DataFrame from list of dict
technologies = [{'Courses':'Spark', 'Fee': 20000, 'Duration':'30days'},
        {'Courses':'Pandas', 'Fee': 25000, 'Duration': '40days'}]

df_dic3 = pd.DataFrame(technologies)

In [9]:
df_dic3

  Courses    Fee Duration
0   Spark  20000   30days
1  Pandas  25000   40days

In [10]:
# Create pandas DataFrame from List
import pandas as pd
technologies = [ ["Spark",20000, "30days"], 
                 ["Pandas",25000, "40days"], 
               ]
df_list=pd.DataFrame(technologies)

In [11]:
df_list

        0      1       2
0   Spark  20000  30days
1  Pandas  25000  40days

In [12]:
# Add Column names & Row Labels to the DataFrame
column_names=["Courses","Fee","Duration"]
row_labels=["a","b"]

df_list=pd.DataFrame(technologies,columns=column_names,index=row_labels)

In [13]:
df_list

  Courses    Fee Duration
a   Spark  20000   30days
b  Pandas  25000   40days

In [14]:
# Create DataFrame from series objects

# Create pandas Series
courses = pd.Series(["Spark","Pandas"])
fees = pd.Series([20000,25000])
duration = pd.Series(['30days','40days'])

df_series1=pd.concat([courses,fees,duration],axis=1)

In [15]:
df_series1

        0      1       2
0   Spark  20000  30days
1  Pandas  25000  40days

In [16]:
# Add Column Labels
# Concat Series by Changing Names
df_series2=pd.concat({'Courses': courses,
              'Course_Fee': fees,
              'Course_Duration': duration}, axis=1)

In [17]:
df_series2

  Courses  Course_Fee Course_Duration
0   Spark       20000          30days
1  Pandas       25000          40days

In [18]:
# Assign Index to Series
index_labels=['r1','r2']
courses.index = index_labels
fees.index = index_labels
duration.index = index_labels

df_series3=pd.concat({'Courses': courses,
              'Course_Fee': fees,
              'Course_Duration': duration}, axis=1)

In [19]:
df_series3

   Courses  Course_Fee Course_Duration
r1   Spark       20000          30days
r2  Pandas       25000          40days

In [2]:
# Creating DataFrame using zip() function
# Create Lists
Courses = ['Spark', 'Pandas']
Fee = [20000,25000]
Duration = ['30days','40days']
   
# Merge lists by using zip() function
tuples_list = list(zip(Courses, Fee, Duration))

In [3]:
tuples_list

[('Spark', 20000, '30days'), ('Pandas', 25000, '40days')]

In [6]:
df_zip = pd.DataFrame(tuples_list, columns = ['Courses', 'Fee', 'Duration'])

In [7]:
df_zip

  Courses    Fee Duration
0   Spark  20000   30days
1  Pandas  25000   40days